lib/tasks/migrate_v1_to_v2.rake

def create_v2_quote_from_v1(base_params, jurisdiction, market_price_per_oz)
  quote = V2::Quote.new base_params
  quote.v2_jurisdiction_id = jurisdiction.id
  quote.price_per_ounce = market_price_per_oz
  quote.save
---
INSERT INTO "v2_jurisdictions" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Florida"], ["created_at", "2021-02-07 15:46:36.365114"], ["updated_at", "2021-02-07 15:46:36.365114"]]
INSERT INTO "v2_quotes" ("date", "vendor_name", "vendor_url", "vendor_branch", "is_primary", "price_per_ounce", "v2_jurisdiction_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"

task migrate_v1_to_v2: :environment do
  california = V2::Jurisdiction.find_or_create_by(name: "California")
  colorado = V2::Jurisdiction.find_or_create_by(name: "Colorado")
  darkweb = V2::Jurisdiction.find_or_create_by(name: "Darkweb")
  florida = V2::Jurisdiction.find_or_create_by(name: "Florida")
  nevada = V2::Jurisdiction.find_or_create_by(name: "Nevada")
  dc = V2::Jurisdiction.find_or_create_by(name: "Washington, D.C.")

  Quote.all.each do |q|
---
INSERT INTO "v2_jurisdictions" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Washington, D.C."], ["created_at", "2021-02-07 15:46:36.373997"], ["updated_at", "2021-02-07 15:46:36.373997"]]
SELECT "v2_jurisdictions".* FROM "v2_jurisdictions" WHERE "v2_jurisdictions"."name" = $1 LIMIT $2  [["name", "California"], ["LIMIT", 1]]
SELECT "v2_jurisdictions".* FROM "v2_jurisdictions" WHERE "v2_jurisdictions"."name" = $1 LIMIT $2  [["name", "Colorado"], ["LIMIT", 1]]
SELECT "v2_jurisdictions".* FROM "v2_jurisdictions" WHERE "v2_jurisdictions"."name" = $1 LIMIT $2  [["name", "Darkweb"], ["LIMIT", 1]]
SELECT "v2_jurisdictions".* FROM "v2_jurisdictions" WHERE "v2_jurisdictions"."name" = $1 LIMIT $2  [["name", "Florida"], ["LIMIT", 1]]
SELECT "v2_jurisdictions".* FROM "v2_jurisdictions" WHERE "v2_jurisdictions"."name" = $1 LIMIT $2  [["name", "Nevada"], ["LIMIT", 1]]
SELECT "v2_jurisdictions".* FROM "v2_jurisdictions" WHERE "v2_jurisdictions"."name" = $1 LIMIT $2  [["name", "Washington, D.C."], ["LIMIT", 1]]
SELECT "quotes".* FROM "quotes"