app/controllers/v2/dailies_controller.rb

SELECT "v2_avg_prices".* FROM "v2_avg_prices" WHERE "v2_avg_prices"."jurisdiction" = $1 AND (date <= '2021-03-01') ORDER BY "v2_avg_prices"."date" ASC, "v2_avg_prices"."date" DESC  [["jurisdiction", "All U.S."]]
---
  def index
    selected_jurisdiction = params[:j] || "All U.S."
    date = params[:date]
    @v2_avg_prices = V2::AvgPrice.where(jurisdiction: selected_jurisdiction).most_recent_on_or_before_date(date)