app/controllers/v2/jurisdictions_controller.rb

  def index
    @v2_jurisdictions = V2::Jurisdiction.all
---
SELECT "v2_jurisdictions".* FROM "v2_jurisdictions"