app/controllers/v2/quotes_controller.rb

SELECT "v2_quotes".* FROM "v2_quotes"
---
  def index
    @v2_quotes = V2::Quote.all

SELECT "v2_quotes".* FROM "v2_quotes" WHERE "v2_quotes"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
---
  def new
    orig_id = params[:clone_id]

    orig = V2::Quote.find(orig_id) if orig_id.present?

INSERT INTO "v2_quotes" ("date", "vendor_name", "vendor_url", "vendor_branch", "is_primary", "price_per_ounce", "v2_jurisdiction_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
  def create
    @v2_quote = V2::Quote.new(v2_quote_params)

    respond_to do |format|
      if @v2_quote.save

UPDATE "v2_quotes" SET "vendor_url" = $1, "is_primary" = $2, "price_per_ounce" = $3, "updated_at" = $4 WHERE "v2_quotes"."id" = $5  [["vendor_url", "rst22"], ["is_primary", true], ["price_per_ounce", "232.0"], ["updated_at", "2021-03-04 00:53:16.708196"], ["id", 14]]
---
  def update
    respond_to do |format|
      if @v2_quote.update(v2_quote_params)

SELECT "v2_quotes".* FROM "v2_quotes" WHERE "v2_quotes"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
---
    def set_v2_quote
      @v2_quote = V2::Quote.find(params[:id])

SELECT "v2_jurisdictions"."id", "v2_jurisdictions"."name" FROM "v2_jurisdictions"
---
    def set_jurisdictions
      @jurisdictions = V2::Jurisdiction.select(:id, :name).map { |j|  [j.name, j.id] }