app/controllers/v2/quotes_submissions_controller.rb

SELECT "v2_quotes_submissions".* FROM "v2_quotes_submissions" WHERE "v2_quotes_submissions"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_v2_quotes_submission
      @v2_quotes_submission = V2::QuotesSubmission.find(params[:id])