app/controllers/v2/quotes_submissions_controller.rb

SELECT "v2_quotes_submissions".* FROM "v2_quotes_submissions"
---
  def index
    @v2_quotes_submissions = V2::QuotesSubmission.all

INSERT INTO "v2_quotes" ("date", "vendor_name", "vendor_url", "vendor_branch", "is_primary", "v2_jurisdiction_id", "created_at", "updated_at", "v2_quotes_submission_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
INSERT INTO "v2_quotes_submissions" ("created_at", "updated_at", "uuid", "confirmation_token") VALUES ($1, $2, $3, $4) RETURNING "id"
---
  def gen
    @v2_quotes_submission = V2::QuotesSubmission.new_prefilled_form
    respond_to do |format|
      if @v2_quotes_submission.save

INSERT INTO "v2_quotes_submissions" ("created_at", "updated_at", "uuid", "confirmation_token") VALUES ($1, $2, $3, $4) RETURNING "id"
INSERT INTO "v2_quotes" ("date", "vendor_name", "vendor_url", "vendor_branch", "is_primary", "price_per_ounce", "v2_jurisdiction_id", "created_at", "updated_at", "v2_quotes_submission_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
---
  def create
    @v2_quotes_submission = V2::QuotesSubmission.new(v2_quotes_submission_params)

    respond_to do |format|
      if @v2_quotes_submission.save

UPDATE "v2_quotes_submissions" SET "updated_at" = $1, "is_confirmed" = $2 WHERE "v2_quotes_submissions"."id" = $3  [["updated_at", "2021-03-08 14:30:02.433164"], ["is_confirmed", true], ["id", 8]]
UPDATE "v2_quotes" SET "price_per_ounce" = $1, "updated_at" = $2 WHERE "v2_quotes"."id" = $3  [["price_per_ounce", "2.0"], ["updated_at", "2021-03-08 14:31:06.562858"], ["id", 120]]
---
  def update
    respond_to do |format|
      if !@v2_quotes_submission.is_confirmed && @v2_quotes_submission.update(v2_quotes_submission_params)

SELECT "v2_quotes_submissions".* FROM "v2_quotes_submissions" WHERE "v2_quotes_submissions"."uuid" = $1 AND "v2_quotes_submissions"."id" = $2 LIMIT $3  [["uuid", "3c5af2f1-ca99-4c6e-927d-f0e20694734b"], ["id", 26], ["LIMIT", 1]]
---
    def set_v2_quotes_submission
      uuid = params[:uuid] || params[:v2_quotes_submission][:uuid]
      @v2_quotes_submission = V2::QuotesSubmission.find_by(uuid: uuid, id: params[:id])