app/models/v2/quotes_submission.rb

  def set_is_confirmed
    self.is_confirmed = quotes.all? { |quote| quote.price_per_ounce.present? }
---
SELECT "v2_quotes".* FROM "v2_quotes" WHERE "v2_quotes"."v2_quotes_submission_id" = $1  [["v2_quotes_submission_id", 1]]