app/controllers/v1/quotes_controller.rb

  def index
    @quotes = Quote.all
---
SELECT "quotes".* FROM "quotes"