rails_backup/app/controllers/pages_controller.rb

  def home
    @page_title       = 'API for weed prices'
    @page_description = 'An API for the price of weed/marijuana, pulling from legal dispensaries and the darknet. Long term crypto oracle.'
    @page_keywords    = 'Weed, API, Marijuana, Crypto, Oracle, Market, Price'

    @selected_jurisdiction = params[:j] || "All U.S."
    selected_avg = V2::AvgPrice.where(jurisdiction: @selected_jurisdiction).where.not(avg_price_per_ounce: nil).order(date: :desc).first

    @price_today = selected_avg ? selected_avg.avg_price_per_ounce.try(:round, 2) : -1
    @jurisdictions = V2::AvgPrice.pluck(:jurisdiction).uniq.sort
---
SELECT "v2_avg_prices".* FROM "v2_avg_prices" WHERE "v2_avg_prices"."jurisdiction" = $1 AND "v2_avg_prices"."avg_price_per_ounce" IS NOT NULL ORDER BY "v2_avg_prices"."date" DESC LIMIT $2  [["jurisdiction", "All U.S."], ["LIMIT", 1]]
SELECT MAX("v2_avg_prices"."date") FROM "v2_avg_prices" WHERE "v2_avg_prices"."jurisdiction" = $1  [["jurisdiction", "All U.S."]]
SELECT "v2_avg_prices"."jurisdiction" FROM "v2_avg_prices"