app/views/v2/quotes_submissions/show.html.erb

SELECT "v2_quotes".* FROM "v2_quotes" WHERE "v2_quotes"."v2_quotes_submission_id" = $1  [["v2_quotes_submission_id", 3]]
---

<% @v2_quotes_submission.quotes.each do |quote| %>