app/controllers/quotes_controller.rb

SELECT "quotes".* FROM "quotes"
---
  def index
    @quotes = Quote.all

INSERT INTO "quotes" ("date", "currency", "mean_price_per_oz", "market1_price_per_oz", "market2_price_per_oz", "market3_price_per_oz", "market4_price_per_oz", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
  def create
    @quote = Quote.new(quote_params)

    respond_to do |format|
      if @quote.save

UPDATE "quotes" SET "date" = $1, "updated_at" = $2 WHERE "quotes"."id" = $3  [["date", "2021-02-03"], ["updated_at", "2021-02-07 16:40:12.157215"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @quote.update(quote_params)

SELECT "quotes".* FROM "quotes" WHERE "quotes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_quote
      @quote = Quote.find(params[:id])